// 35 Циклы

// 1. Имеется массив из 20 чисел. Вывести на экран только четные числа из массива

// 2. Имеется массив строк с 10 элементами. Вывести на экран самое длинное слово из массива

// 3. Массовое удаление. Имеется массив, который содержит имена 15 пользователей. Необходимо удалить всех пользователей. При удалении каждого пользователя нужно выводить сообщения: «Удаляю пользователя Иван» «Удаляю пользователя Вася» …

// 4. Строка называется палиндромом, если она пишется одинаково в обоих направлениях. Например, палиндромами в английском языке являются слова «anna», «civic», «level», «hannah». Напишите программу, запрашивающую у пользователя строку и при помощи цикла определяющую, является ли она палиндромом.


// 5. Вывести таблицу умножения от 0 до 10