// 37 object

// 1. Создать массив из 15 объектов с постами для сайта блога с ключами title, и author. Необходимо перебрать массив и вывести название поста в теге h3, и автора в теге p

// 2. Имеется массив имен, необходимо перебрать массив и все имена из массива нужно перенести в массив объектов и записать под ключом name.

// 3. Имеется массив объектов с фильмами. У объектов имеются ключи: title (название фильма), director (режиссёр) и duration (длительность в минутах). Необходимо вывести 3 фильма с наиболее длинным хронометражом.