// 36 functions

// 1. Написать функцию, которой передаем, имя, фамилия и возраст, и получаем строку "Привет Иван Петров с возрастом 17 лет"

// 2. Напишите функцию, которая принимает параметром число от 1 до 7, а возвращает день недели на русском языке

// 3. Написать функцию, которой передаем имя, и она возраващает приветствие в зависимости от времени суток (Доброе утро\день\вечер\ночи Иван)

// 4. Напишите функцию, которая принимает в качестве параметра целое число и возвращает: -1 если число отрицательное ... 0 если число 0 ... 1 если число положительное


// 5. Напишите функцию, которая будет принимать в качестве параметров
// строку s, а также ширину окна в символах – w. Возвращать функция долж-
// на новую строку, в которой в начале и в конце добавлено необходимое количество
// знака `-`, чтобы первоначальная строка оказалась размещена по цент-
// ру заданного окна а по бокам строки добавлены знаки. Новая строка должна формироваться по следующему принципу:
// - если длина исходной строки s больше или равна ширине заданного
// окна, возвращаем ее в неизменном виде;
// - в противном случае должна быть возвращена строка следующего вида: (функцию передана строка "hi", ширина 20) вывод: `--------hi----------`